
     H DFTACTGRP(*NO)

     FHELLOWORLDCF   E             WORKSTN Handler('PROFOUNDUI(HANDLER)')

      /Free
         ExFmt HELLO;
         *InLr = *On;
      /End-Free

